Revit 2027 API
BarTerminationsData.HookTypeIdAtEnd Property
 Identifies the hook type at the end of bar. Setting this property to a valid value, will set the CrankTypeIdAtEnd and EndTreatmentTypeIdAtEnd to ElementId.InvalidElementId.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId HookTypeIdAtEnd { get; set; }
Public Property HookTypeIdAtEnd As ElementId
	Get
	Set
public:
property ElementId^ HookTypeIdAtEnd {
	ElementId^ get ();
	void set (ElementId^ value);
}
member HookTypeIdAtEnd : ElementId with get, set
Property Value
ElementId
Exceptions
Exception | Condition
ArgumentException |  When setting this property: hookTypeIdAtEnd doesn't represent a hook type.
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
BarTerminationsData Class
Autodesk.Revit.DB.Structure Namespace